Education/IEEE 11073 SDC/Medical_Devices_Profile_for_Web_Services/DPWS_Messages/MetadataGet.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope xmlns:dpws="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01" xmlns:s12="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex">
	<s12:Header>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/mex/GetMetadata/Request</wsa:Action>
		<wsa:MessageID>urn:uuid:b06e77f0-1c5f-11e7-808c-c247d6c531f6</wsa:MessageID>
		<wsa:To>http://10.52.219.53:54556/426896ea-edb7-425c-a4a3-ef7e892e94f4/Get/</wsa:To>
	</s12:Header>
	<s12:Body>
		<wsx:GetMetadata/>
	</s12:Body>
</s12:Envelope>
